zhanzr/xmc1100-cpp/RTE/Device/XMC1200-T038x0200/RTE_Device.h
/*
 * Copyright (C) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use with Infineon's microcontrollers.
 * This file can be freely distributed within development tools that are supporting such microcontrollers.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,OR CONSEQUENTIAL DAMAGES, FOR ANY REASON
 * WHATSOEVER.
 *
 */

/**
 * @file RTE_Device.h
 * @date 16 Feb, 2015
 * @version 1.0.0
 *
 * @brief RTE Device Configuration for Infineon XMC1200-T38
 *
 * History
 *
 * Version 1.0.0 Initial version<br>
 */

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

#ifndef __RTE_DEVICE_H
#define __RTE_DEVICE_H

#include "xmc_device.h"
#include "xmc1_gpio_map.h"
#include "xmc1_usic_map.h"

#define NO_FIFO 0
#define FIFO_SIZE_2 1
#define FIFO_SIZE_4 2
#define FIFO_SIZE_8 3
#define FIFO_SIZE_16 4
#define FIFO_SIZE_32 5
#define FIFO_SIZE_64 6

// <e> UART0 (Universal asynchronous receiver transmitter) [Driver_USART0]
// <i> Configuration settings for Driver_USART0 in component ::Drivers:UART
#define RTE_UART0                      0

//   <o> UART0_TX Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1 <4=>P1_5 <5=>P2_0 <6=>P2_1     
#define RTE_UART0_TX_ID                0

#if    (RTE_UART0_TX_ID == 0)
#define RTE_UART0_TX_PORT              P0_14
#define RTE_UART0_TX_AF                P0_14_AF_U0C0_DOUT0
#elif  (RTE_UART0_TX_ID == 1)
#define RTE_UART0_TX_PORT              P0_15
#define RTE_UART0_TX_AF                P0_15_AF_U0C0_DOUT0
#elif  (RTE_UART0_TX_ID == 2)
#define RTE_UART0_TX_PORT              P1_0
#define RTE_UART0_TX_AF                P1_0_AF_U0C0_DOUT0
#elif  (RTE_UART0_TX_ID == 3)
#define RTE_UART0_TX_PORT              P1_1
#define RTE_UART0_TX_AF                P1_1_AF_U0C0_DOUT0
#elif  (RTE_UART0_TX_ID == 4)
#define RTE_UART0_TX_PORT              P1_5
#define RTE_UART0_TX_AF                P1_5_AF_U0C0_DOUT0
#elif  (RTE_UART0_TX_ID == 5)
#define RTE_UART0_TX_PORT              P2_0
#define RTE_UART0_TX_AF                P2_0_AF_U0C0_DOUT0
#elif  (RTE_UART0_TX_ID == 6)
#define RTE_UART0_TX_PORT              P2_1
#define RTE_UART0_TX_AF                P2_1_AF_U0C0_DOUT0
#else
#error "Invalid UART0_TX Pin Configuration!"
#endif

//   <o> UART0_RX Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1 <4=>P2_0   
#define RTE_UART0_RX_ID                1

#if    (RTE_UART0_RX_ID == 0)
#define RTE_UART0_RX_PORT              P0_14
#define RTE_UART0_RX_INPUT             USIC0_C0_DX0_P0_14
#elif  (RTE_UART0_RX_ID == 1)
#define RTE_UART0_RX_PORT              P0_15
#define RTE_UART0_RX_INPUT             USIC0_C0_DX0_P0_15
#elif  (RTE_UART0_RX_ID == 2)
#define RTE_UART0_RX_PORT              P1_0
#define RTE_UART0_RX_INPUT             USIC0_C0_DX0_P1_0
#elif  (RTE_UART0_RX_ID == 3)
#define RTE_UART0_RX_PORT              P1_1
#define RTE_UART0_RX_INPUT             USIC0_C0_DX0_P1_1
#elif  (RTE_UART0_RX_ID == 4)
#define RTE_UART0_RX_PORT              P2_0
#define RTE_UART0_RX_INPUT             USIC0_C0_DX0_P2_0
#else
#error "Invalid UART0_RX Pin Configuration!"
#endif

//   <o> UART0_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64
#define RTE_UART0_RX_FIFO_SIZE_ID                5

#if    (RTE_UART0_RX_FIFO_SIZE_ID == 0)
#define RTE_UART0_RX_FIFO_SIZE         NO_FIFO
#define RTE_UART0_RX_FIFO_SIZE_NUM     0
#elif  (RTE_UART0_RX_FIFO_SIZE_ID == 1)
#define RTE_UART0_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART0_RX_FIFO_SIZE_NUM     2
#elif  (RTE_UART0_RX_FIFO_SIZE_ID == 2)
#define RTE_UART0_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART0_RX_FIFO_SIZE_NUM     4
#elif  (RTE_UART0_RX_FIFO_SIZE_ID == 3)
#define RTE_UART0_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART0_RX_FIFO_SIZE_NUM     4
#elif  (RTE_UART0_RX_FIFO_SIZE_ID == 4)
#define RTE_UART0_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART0_RX_FIFO_SIZE_NUM     16
#elif  (RTE_UART0_RX_FIFO_SIZE_ID == 5)
#define RTE_UART0_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART0_RX_FIFO_SIZE_NUM     32
#elif  (RTE_UART0_RX_FIFO_SIZE_ID == 6)
#define RTE_UART0_RX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_UART0_RX_FIFO_SIZE_NUM     64
#else
#error "Invalid UART0_RX FIFO SIZE Configuration!"
#endif

//   <o> UART0_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64 
#define RTE_UART0_TX_FIFO_SIZE_ID                5
#if    (RTE_UART0_TX_FIFO_SIZE_ID == 0)
#define RTE_UART0_TX_FIFO_SIZE         NO_FIFO
#define RTE_UART0_TX_FIFO_SIZE_NUM     0
#elif  (RTE_UART0_TX_FIFO_SIZE_ID == 1)
#define RTE_UART0_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_UART0_TX_FIFO_SIZE_NUM     2
#elif  (RTE_UART0_TX_FIFO_SIZE_ID == 2)
#define RTE_UART0_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART0_TX_FIFO_SIZE_NUM     4
#elif  (RTE_UART0_TX_FIFO_SIZE_ID == 3)
#define RTE_UART0_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_UART0_TX_FIFO_SIZE_NUM     4
#elif  (RTE_UART0_TX_FIFO_SIZE_ID == 4)
#define RTE_UART0_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_UART0_TX_FIFO_SIZE_NUM     16
#elif  (RTE_UART0_TX_FIFO_SIZE_ID == 5)
#define RTE_UART0_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_UART0_TX_FIFO_SIZE_NUM     32
#elif  (RTE_UART0_TX_FIFO_SIZE_ID == 6)
#define RTE_UART0_TX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_UART0_TX_FIFO_SIZE_NUM     64
#else
#error "Invalid UART0_TX FIFO SIZE Configuration!"
#endif
//</e>

// <e> UART1 (Universal asynchronous receiver transmitter) [Driver_USART1]
// <i> Configuration settings for Driver_USART1 in component ::Drivers:UART
#define RTE_UART1                      1

//   <o> UART1_TX Pin <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <4=>P2_10 <5=>P2_11        
#define RTE_UART1_TX_ID                2

#if    (RTE_UART1_TX_ID == 0)
#define RTE_UART1_TX_PORT              P0_6
#define RTE_UART1_TX_AF                P0_6_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 1)
#define RTE_UART1_TX_PORT              P0_7
#define RTE_UART1_TX_AF                P0_7_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 2)
#define RTE_UART1_TX_PORT              P1_2
#define RTE_UART1_TX_AF                P1_2_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 3)
#define RTE_UART1_TX_PORT              P1_3
#define RTE_UART1_TX_AF                P1_3_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 4)
#define RTE_UART1_TX_PORT              P2_10
#define RTE_UART1_TX_AF                P2_10_AF_U0C1_DOUT0
#elif  (RTE_UART1_TX_ID == 5)
#define RTE_UART1_TX_PORT              P2_11
#define RTE_UART1_TX_AF                P2_11_AF_U0C1_DOUT0
#else
#error "Invalid UART1_TX Pin Configuration!"
#endif

