zhanzr/xmc1100-cpp/RTE/Device/XMC1200-T038x0200/RTE_Device.h
//   <o> SPI0_SLAVE SELECT LINE 0 Pin <0=>P0_0 <1=>P0_9 <2=>P1_4 
#define RTE_SPI0_SLAVE_SELECT_LINE_0_ID                0

#if    (RTE_SPI0_SLAVE_SELECT_LINE_0_ID == 0)
#define RTE_SPI0_SLAVE_SELECT_LINE_0_PORT              P0_0
#define RTE_SPI0_SLAVE_SELECT_LINE_0_AF                P0_0_AF_U0C0_SELO0
#elif  (RTE_SPI0_SLAVE_SELECT_LINE_0_ID == 1)
#define RTE_SPI0_SLAVE_SELECT_LINE_0_PORT              P0_9
#define RTE_SPI0_SLAVE_SELECT_LINE_0_AF                P0_9_AF_U0C0_SELO0
#elif  (RTE_SPI0_SLAVE_SELECT_LINE_0_ID == 2)
#define RTE_SPI0_SLAVE_SELECT_LINE_0_PORT              P1_4
#define RTE_SPI0_SLAVE_SELECT_LINE_0_AF                P1_4_AF_U0C0_SELO0
#else
#error "Invalid SPI0 SLAVE SELECT LINE 0 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 1
// <i> Enable slave select line 1
#define RTE_SPI0_SLAVE_SELECT_LINE1 0 

//   <o> SPI0_SLAVE SELECT LINE 1 Pin <0=>P0_10 <1=>P1_5
#define RTE_SPI0_SLAVE_SELECT_LINE_1_ID                0

#if    (RTE_SPI0_SLAVE_SELECT_LINE_1_ID == 0)
#define RTE_SPI0_SLAVE_SELECT_LINE_1_PORT              P0_10
#define RTE_SPI0_SLAVE_SELECT_LINE_1_AF                P0_10_AF_U0C0_SELO1
#elif    (RTE_SPI0_SLAVE_SELECT_LINE_1_ID == 1)
#define RTE_SPI0_SLAVE_SELECT_LINE_1_PORT              P1_5
#define RTE_SPI0_SLAVE_SELECT_LINE_1_AF                P1_5_AF_U0C0_SELO1
#else
#error "Invalid SPI0 SLAVE SELECT LINE 1 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 2
// <i> Enable slave select line 1
#define RTE_SPI0_SLAVE_SELECT_LINE2 0 
//   <o> SPI0_SLAVE SELECT LINE 2 Pin <0=>P0_11 
#define RTE_SPI0_SLAVE_SELECT_LINE_2_ID                0

#if    (RTE_SPI0_SLAVE_SELECT_LINE_2_ID == 0)
#define RTE_SPI0_SLAVE_SELECT_LINE_2_PORT              P0_11
#define RTE_SPI0_SLAVE_SELECT_LINE_2_AF                P0_11_AF_U0C0_SELO2
#else
#error "Invalid SPI0 SLAVE SELECT LINE 2 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 3
// <i> Enable slave select line 3
#define RTE_SPI0_SLAVE_SELECT_LINE3 0
//   <o> SPI0_SLAVE SELECT LINE 3 Pin <0=>P0_12 
#define RTE_SPI0_SLAVE_SELECT_LINE_3_ID                0

#if    (RTE_SPI0_SLAVE_SELECT_LINE_3_ID == 0)
#define RTE_SPI0_SLAVE_SELECT_LINE_3_PORT              P0_12
#define RTE_SPI0_SLAVE_SELECT_LINE_3_AF                P0_12_AF_U0C0_SELO3
#else
#error "Invalid SPI0 SLAVE SELECT LINE 3 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 4
// <i> Enable slave select line 4
#define RTE_SPI0_SLAVE_SELECT_LINE4 0
//   <o> SPI0_SLAVE SELECT LINE 4 Pin <0=>P0_13 
#define RTE_SPI0_SLAVE_SELECT_LINE_4_ID                0

#if    (RTE_SPI0_SLAVE_SELECT_LINE_4_ID == 0)
#define RTE_SPI0_SLAVE_SELECT_LINE_4_PORT              P0_13
#define RTE_SPI0_SLAVE_SELECT_LINE_4_AF                P0_13_AF_U0C0_SELO4
#else
#error "Invalid SPI0 SLAVE SELECT LINE 4 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 5
// <i> Enable slave select line 5
#define RTE_SPI0_SLAVE_SELECT_LINE5 0 
#if    (RTE_SPI0_SLAVE_SELECT_LINE5 == 1)
#error "Invalid SPI0 SLAVE SELECT LINE 5 Pin Configuration!"
#endif
// </e>


// </h>
//   <o> SPI0_CLK INPUT Pin <0=>P0_14 <1=>P0_8 <2=>P0_7 <3=>P1_1 <4=>P2_0 
#define RTE_SPI0_CLK_INPUT_ID                1

#if    (RTE_SPI0_CLK_INPUT_ID == 0)
#define RTE_SPI0_CLK_INPUT_PORT              P0_14
#define RTE_SPI0_CLK_INPUT                   USIC0_C0_DX1_P0_14
#elif  (RTE_SPI0_CLK_INPUT_ID == 1)
#define RTE_SPI0_CLK_INPUT_PORT              P0_8
#define RTE_SPI0_CLK_INPUT                   USIC0_C0_DX1_P0_8
#elif  (RTE_SPI0_CLK_INPUT_ID == 2)
#define RTE_SPI0_CLK_INPUT_PORT              P0_7
#define RTE_SPI0_CLK_INPUT                   USIC0_C0_DX1_P0_7
#elif  (RTE_SPI0_CLK_INPUT_ID == 3)
#define RTE_SPI0_CLK_INPUT_PORT              P1_1
#define RTE_SPI0_CLK_INPUT                   USIC0_C0_DX1_P1_1
#elif  (RTE_SPI0_CLK_INPUT_ID == 4)
#define RTE_SPI0_CLK_INPUT_PORT              P2_0
#define RTE_SPI0_CLK_INPUT                   USIC0_C0_DX1_P2_0
#else
#error "Invalid SPI0 CLOCK INPUT Pin Configuration!"
#endif

//   <o> RTE_SPI0_SLAVE_SELECT INPUT Pin <0=>P0_0 <1=>P0_9 <2=>P0_10 <3=>P0_11 <4=>P0_12 <5=>P0_13
 
#define RTE_SPI0_SLAVE_SELECT_INPUT_ID                0

#if    (RTE_SPI0_SLAVE_SELECT_INPUT_ID == 0)
#define RTE_SPI0_SLAVE_SELECT_INPUT_PORT              P0_0
#define RTE_SPI0_SLAVE_SELECT_INPUT                   USIC0_C0_DX2_P0_0
#elif  (RTE_SPI0_SLAVE_SELECT_INPUT_ID == 1)
#define RTE_SPI0_SLAVE_SELECT_INPUT_PORT              P0_9
#define RTE_SPI0_SLAVE_SELECT_INPUT                   USIC0_C0_DX2_P0_9
#elif  (RTE_SPI0_SLAVE_SELECT_INPUT_ID == 2)
#define RTE_SPI0_SLAVE_SELECT_INPUT_PORT              P0_10
#define RTE_SPI0_SLAVE_SELECT_INPUT                   USIC0_C0_DX2_P0_10
#elif  (RTE_SPI0_SLAVE_SELECT_INPUT_ID == 3)
#define RTE_SPI0_SLAVE_SELECT_INPUT_PORT              P0_11
#define RTE_SPI0_SLAVE_SELECT_INPUT                   USIC0_C0_DX2_P0_11
#elif  (RTE_SPI0_SLAVE_SELECT_INPUT_ID == 4)
#define RTE_SPI0_SLAVE_SELECT_INPUT_PORT              P0_12
#define RTE_SPI0_SLAVE_SELECT_INPUT                   USIC0_C0_DX2_P0_12
#elif  (RTE_SPI0_SLAVE_SELECT_INPUT_ID == 5)
#define RTE_SPI0_SLAVE_SELECT_INPUT_PORT              P0_13
#define RTE_SPI0_SLAVE_SELECT_INPUT                   USIC0_C0_DX2_P0_13
#else
#error "Invalid SPI0 SLAVE SELECT INPUT Pin Configuration!"
#endif

//   <o> SPI0_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64
#define RTE_SPI0_RX_FIFO_SIZE_ID                2

#if    (RTE_SPI0_RX_FIFO_SIZE_ID == 0)
#define RTE_SPI0_RX_FIFO_SIZE         NO_FIFO
#define RTE_SPI0_RX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI0_RX_FIFO_SIZE_ID == 1)
#define RTE_SPI0_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI0_RX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI0_RX_FIFO_SIZE_ID == 2)
#define RTE_SPI0_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI0_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI0_RX_FIFO_SIZE_ID == 3)
#define RTE_SPI0_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI0_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI0_RX_FIFO_SIZE_ID == 4)
#define RTE_SPI0_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI0_RX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI0_RX_FIFO_SIZE_ID == 5)
#define RTE_SPI0_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI0_RX_FIFO_SIZE_NUM     32
#elif  (RTE_SPI0_RX_FIFO_SIZE_ID == 6)
#define RTE_SPI0_RX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_SPI0_RX_FIFO_SIZE_NUM     64
#else
#error "Invalid SPI0_RX FIFO SIZE Configuration!"
#endif

//   <o> SPI0_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64 
#define RTE_SPI0_TX_FIFO_SIZE_ID                4

#if    (RTE_SPI0_TX_FIFO_SIZE_ID == 0)
#define RTE_SPI0_TX_FIFO_SIZE         NO_FIFO
#define RTE_SPI0_TX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI0_TX_FIFO_SIZE_ID == 1)
#define RTE_SPI0_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI0_TX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI0_TX_FIFO_SIZE_ID == 2)
#define RTE_SPI0_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI0_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI0_TX_FIFO_SIZE_ID == 3)
#define RTE_SPI0_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI0_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI0_TX_FIFO_SIZE_ID == 4)
#define RTE_SPI0_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI0_TX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI0_TX_FIFO_SIZE_ID == 5)
#define RTE_SPI0_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI0_TX_FIFO_SIZE_NUM     32
#elif  (RTE_SPI0_TX_FIFO_SIZE_ID == 6)
#define RTE_SPI0_TX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_SPI0_TX_FIFO_SIZE_NUM     64
#else
#error "Invalid SPI0_TX FIFO SIZE Configuration!"
#endif
//</e>

// <e> SPI1 (Serial peripheral interface) [Driver_SPI1]
// <i> Configuration settings for Driver_SPI1 in component ::Drivers:SPI
#define RTE_SPI1                      0

//   <o> SPI1 TX MOSI(master) MISO(slave) <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <4=>P2_10 <5=>P2_11   
#define RTE_SPI1_TX_ID                0

#if    (RTE_SPI1_TX_ID == 0)
#define RTE_SPI1_TX_PORT              P0_6
#define RTE_SPI1_TX_AF                P0_6_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 1)
#define RTE_SPI1_TX_PORT              P0_7
#define RTE_SPI1_TX_AF                P0_7_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 2)
#define RTE_SPI1_TX_PORT              P1_2
#define RTE_SPI1_TX_AF                P1_2_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 3)
#define RTE_SPI1_TX_PORT              P1_3
#define RTE_SPI1_TX_AF                P1_3_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 4)
#define RTE_SPI1_TX_PORT              P2_10
#define RTE_SPI1_TX_AF                P2_10_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 5)
#define RTE_SPI1_TX_PORT              P2_11
#define RTE_SPI1_TX_AF                P2_11_AF_U0C1_DOUT0
#else
#error "Invalid SPI1_TX Pin Configuration!"
#endif

//   <o> SPI1 RX MISO(master) MOSI(slave) Pin <0=>P1_3 <1=>P1_2 <2=>P0_6 <3=>P0_7 
#define RTE_SPI1_RX_ID                1

