zhanzr/xmc1100-cpp/RTE/Device/XMC1200-T038x0200/RTE_Device.h
#if    (RTE_SPI1_RX_ID == 0)
#define RTE_SPI1_RX_PORT              P1_3
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P1_3
#elif  (RTE_SPI1_RX_ID == 1)
#define RTE_SPI1_RX_PORT              P1_2
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P1_2
#elif  (RTE_SPI1_RX_ID == 2)
#define RTE_SPI1_RX_PORT              P0_6
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P0_6
#elif  (RTE_SPI1_RX_ID == 3)
#define RTE_SPI1_RX_PORT              P0_7
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P0_7
#else
#error "Invalid SPI1_RX Pin Configuration!"
#endif


//   <o> SPI1_CLK OUTPUT Pin <0=>P0_8 <1=>P1_3 <2=>P1_4 <3=>P2_1 <4=>P2_11
#define RTE_SPI1_CLK_OUTPUT_ID                0

#if    (RTE_SPI1_CLK_OUTPUT_ID == 0)
#define RTE_SPI1_CLK_OUTPUT_PORT              P0_8
#define RTE_SPI1_CLK_AF                       P0_8_AF_U0C1_SCLKOUT
#elif  (RTE_SPI1_CLK_OUTPUT_ID == 1)
#define RTE_SPI1_CLK_OUTPUT_PORT              P1_3
#define RTE_SPI1_CLK_AF                       P1_3_AF_U0C1_SCLKOUT
#elif  (RTE_SPI1_CLK_OUTPUT_ID == 2)
#define RTE_SPI1_CLK_OUTPUT_PORT              P1_4
#define RTE_SPI1_CLK_AF                       P1_4_AF_U0C1_SCLKOUT
#elif  (RTE_SPI1_CLK_OUTPUT_ID == 3)
#define RTE_SPI1_CLK_OUTPUT_PORT              P2_1
#define RTE_SPI1_CLK_AF                       P2_1_AF_U0C1_SCLKOUT
#elif  (RTE_SPI1_CLK_OUTPUT_ID == 4)
#define RTE_SPI1_CLK_OUTPUT_PORT              P2_11
#define RTE_SPI1_CLK_AF                       P2_11_AF_U0C1_SCLKOUT
#else
#error "Invalid SPI1 CLOCK OUTPUT Pin Configuration!"
#endif

// <h> SPI1_SLAVE SELECT Pins
// <e> SLAVE SELECT LINE 0
// <i> Enable slave select line 0
#define RTE_SPI1_SLAVE_SELECT_LINE0 1

//   <o> SPI1_SLAVE SELECT LINE 0 Pin <0=>P0_0 <1=>P0_9 <2=>P1_1

#define RTE_SPI1_SLAVE_SELECT_LINE_0_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_LINE_0_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_LINE_0_PORT              P0_0
#define RTE_SPI1_SLAVE_SELECT_LINE_0_AF                P0_0_AF_U0C1_SELO0
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_0_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_LINE_0_PORT              P0_9
#define RTE_SPI1_SLAVE_SELECT_LINE_0_AF                P0_9_AF_U0C1_SELO0
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_0_ID == 2)
#define RTE_SPI1_SLAVE_SELECT_LINE_0_PORT              P1_1
#define RTE_SPI1_SLAVE_SELECT_LINE_0_AF                P1_1_AF_U0C1_SELO0
#else
#error "Invalid SPI1 SLAVE SELECT LINE 0 Pin Configuration!"
#endif

//   <o> SPI1_SLAVE SELECT LINE 1 Pin <0=>P0_10 <1=>P1_4 

#define RTE_SPI1_SLAVE_SELECT_LINE_1_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_LINE_1_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_LINE_1_PORT              P0_10
#define RTE_SPI1_SLAVE_SELECT_LINE_1_AF                P0_10_AF_U0C1_SELO1
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_1_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_LINE_1_PORT              P1_4
#define RTE_SPI1_SLAVE_SELECT_LINE_1_AF                P1_4_AF_U0C1_SELO1
#else
#error "Invalid SPI1 SLAVE SELECT LINE 1 Pin Configuration!"
#endif

//   <o> SPI1_SLAVE SELECT LINE 2 Pin <0=>P0_11 <1=>P1_5 

#define RTE_SPI1_SLAVE_SELECT_LINE_2_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_LINE_2_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_LINE_2_PORT              P0_11
#define RTE_SPI1_SLAVE_SELECT_LINE_2_AF                P0_11_AF_U0C1_SELO2
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_2_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_LINE_2_PORT              P1_5
#define RTE_SPI1_SLAVE_SELECT_LINE_2_AF                P1_5_AF_U0C1_SELO2
#else
#error "Invalid SPI1 SLAVE SELECT LINE 2 Pin Configuration!"
#endif
// </e>
// <e> SLAVE SELECT LINE 3
// <i> Enable slave select line 3
#define RTE_SPI1_SLAVE_SELECT_LINE3 0
#if    (RTE_SPI1_SLAVE_SELECT_LINE3 == 1)
#error "Invalid SPI1 SLAVE SELECT LINE 3 Configuration!"
#endif
// </e>
// </h>
//   <o> SPI1_CLK INPUT Pin <0=>P1_3 <1=>P0_8 <2=>P0_7 
  
#define RTE_SPI1_CLK_INPUT_ID                0

#if    (RTE_SPI1_CLK_INPUT_ID == 0)
#define RTE_SPI1_CLK_INPUT_PORT              P1_3
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P1_3
#elif  (RTE_SPI1_CLK_INPUT_ID == 1)
#define RTE_SPI1_CLK_INPUT_PORT              P0_8
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P0_8
#elif  (RTE_SPI1_CLK_INPUT_ID == 2)
#define RTE_SPI1_CLK_INPUT_PORT              P0_7
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P0_7
#else
#error "Invalid SPI1 CLOCK INPUT Pin Configuration!"
#endif

//   <o> RTE_SPI1_SLAVE_SELECT INPUT Pin <0=>P0_0 <1=>P0_9 <2=>P0_10 <3=>P0_11 <4=>P1_1 <5=>P2_0

#define RTE_SPI1_SLAVE_SELECT_INPUT_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_0
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_0
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_9
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_9
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 2)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_10
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_10
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 3)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_11
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_11
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 4)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P1_1
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P1_1
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 5)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P2_0
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P2_0
#else
#error "Invalid SPI1 SLAVE SELECT INPUT Pin Configuration!"
#endif

//   <o> SPI1_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64
#define RTE_SPI1_RX_FIFO_SIZE_ID                2

#if    (RTE_SPI1_RX_FIFO_SIZE_ID == 0)
#define RTE_SPI1_RX_FIFO_SIZE         NO_FIFO
#define RTE_SPI1_RX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 1)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI1_RX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 2)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 3)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 4)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI1_RX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 5)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI1_RX_FIFO_SIZE_NUM     32
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 6)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_SPI1_RX_FIFO_SIZE_NUM     64
#else
#error "Invalid SPI1_RX FIFO SIZE Configuration!"
#endif

//   <o> SPI1_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64 
#define RTE_SPI1_TX_FIFO_SIZE_ID                2

#if    (RTE_SPI1_TX_FIFO_SIZE_ID == 0)
#define RTE_SPI1_TX_FIFO_SIZE         NO_FIFO
#define RTE_SPI1_TX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 1)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI1_TX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 2)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 3)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 4)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI1_TX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 5)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI1_TX_FIFO_SIZE_NUM     32
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 6)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_SPI1_TX_FIFO_SIZE_NUM     64
#else
#error "Invalid SPI1_TX FIFO SIZE Configuration!"
#endif
//</e>

// <e> I2C0 (Inter-Integrated circuit) [Driver_I2C0]
// <i> Configuration settings for Driver_I2C0 in component ::Drivers:I2C
#define RTE_I2C0                      0

//   <o> I2C0_TX Pin Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1 <4=>P1_5 <5=>P2_0 <6=>P2_1     
#define RTE_I2C0_TX_ID                      0

#if    (RTE_I2C0_TX_ID == 0)
#define RTE_I2C0_TX_PORT              P0_14
#define RTE_I2C0_TX_AF                P0_14_AF_U0C0_DOUT0
#elif  (RTE_I2C0_TX_ID == 1)
#define RTE_I2C0_TX_PORT              P0_15
#define RTE_I2C0_TX_AF                P0_15_AF_U0C0_DOUT0
#elif  (RTE_I2C0_TX_ID == 2)
#define RTE_I2C0_TX_PORT              P1_0
#define RTE_I2C0_TX_AF                P1_0_AF_U0C0_DOUT0
#elif  (RTE_I2C0_TX_ID == 3)
#define RTE_I2C0_TX_PORT              P1_1
#define RTE_I2C0_TX_AF                P1_1_AF_U0C0_DOUT0
#elif  (RTE_I2C0_TX_ID == 4)
#define RTE_I2C0_TX_PORT              P1_5
#define RTE_I2C0_TX_AF                P1_5_AF_U0C0_DOUT0
#elif  (RTE_I2C0_TX_ID == 5)
#define RTE_I2C0_TX_PORT              P2_0
#define RTE_I2C0_TX_AF                P2_0_AF_U0C0_DOUT0
#elif  (RTE_I2C0_TX_ID == 6)
#define RTE_I2C0_TX_PORT              P2_1
#define RTE_I2C0_TX_AF                P2_1_AF_U0C0_DOUT0
#else
#error "Invalid I2C0_TX Pin Configuration!"
#endif

//   <o> I2C0_RX Pin Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1   
#define RTE_I2C0_RX_ID                1

#if    (RTE_I2C0_RX_ID == 0)
#define RTE_I2C0_RX_PORT              P0_14
#define RTE_I2C0_RX_INPUT             USIC0_C0_DX0_P0_14
#elif  (RTE_I2C0_RX_ID == 1)
#define RTE_I2C0_RX_PORT              P0_15
#define RTE_I2C0_RX_INPUT             USIC0_C0_DX0_P0_15
#elif  (RTE_I2C0_RX_ID == 2)
#define RTE_I2C0_RX_PORT              P1_0
#define RTE_I2C0_RX_INPUT             USIC0_C0_DX0_P1_0
#elif  (RTE_I2C0_RX_ID == 3)
#define RTE_I2C0_RX_PORT              P1_1
#define RTE_I2C0_RX_INPUT             USIC0_C0_DX0_P1_1
#else
#error "Invalid I2C0_RX Pin Configuration!"
#endif


