zhanzr/xmc1100-cpp/RTE/Device/XMC1200-T038x0200/RTE_Device.h
//   <o> I2C0_CLK OUTPUT Pin <0=>P0_7 <1=>P0_8 <2=>P0_14 <3=>P2_0  

#define RTE_I2C0_CLK_OUTPUT_ID                0

#if    (RTE_I2C0_CLK_OUTPUT_ID == 0)
#define RTE_I2C0_CLK_OUTPUT_PORT              P0_7
#define RTE_I2C0_CLK_AF                       P0_7_AF_U0C0_SCLKOUT 
#elif  (RTE_I2C0_CLK_OUTPUT_ID == 1)
#define RTE_I2C0_CLK_OUTPUT_PORT              P0_8
#define RTE_I2C0_CLK_AF                       P0_8_AF_U0C0_SCLKOUT
#elif  (RTE_I2C0_CLK_OUTPUT_ID == 2)
#define RTE_I2C0_CLK_OUTPUT_PORT              P0_14
#define RTE_I2C0_CLK_AF                       P0_14_AF_U0C0_SCLKOUT
#elif  (RTE_I2C0_CLK_OUTPUT_ID == 3)
#define RTE_I2C0_CLK_OUTPUT_PORT              P2_0
#define RTE_I2C0_CLK_AF                       P2_0_AF_U0C0_SCLKOUT
#else
#error "Invalid I2C0 CLOCK OUTPUT Pin Configuration!"
#endif


//   <o> I2C0_CLK INPUT Pin  <0=>P0_14 <1=>P0_8 <2=>P0_7 <3=>P1_1 <4=>P2_0 

#define RTE_I2C0_CLK_INPUT_ID                1

#if    (RTE_I2C0_CLK_INPUT_ID == 0)
#define RTE_I2C0_CLK_INPUT_PORT              P0_14
#define RTE_I2C0_CLK_INPUT                   USIC0_C0_DX1_P0_14
#elif  (RTE_I2C0_CLK_INPUT_ID == 1)
#define RTE_I2C0_CLK_INPUT_PORT              P0_8
#define RTE_I2C0_CLK_INPUT                   USIC0_C0_DX1_P0_8
#elif  (RTE_I2C0_CLK_INPUT_ID == 2)
#define RTE_I2C0_CLK_INPUT_PORT              P0_7
#define RTE_I2C0_CLK_INPUT                   USIC0_C0_DX1_P0_7
#elif  (RTE_I2C0_CLK_INPUT_ID == 3)
#define RTE_I2C0_CLK_INPUT_PORT              P1_1
#define RTE_I2C0_CLK_INPUT                   USIC0_C0_DX1_P1_1
#elif  (RTE_I2C0_CLK_INPUT_ID == 4)
#define RTE_I2C0_CLK_INPUT_PORT              P2_0
#define RTE_I2C0_CLK_INPUT                   USIC0_C0_DX1_P2_0
#else
#error "Invalid I2C0 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2C0_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64
#define RTE_I2C0_RX_FIFO_SIZE_ID                2
#if    (RTE_I2C0_RX_FIFO_SIZE_ID == 0)
#define RTE_I2C0_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2C0_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2C0_RX_FIFO_SIZE_ID == 1)
#define RTE_I2C0_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2C0_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2C0_RX_FIFO_SIZE_ID == 2)
#define RTE_I2C0_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2C0_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2C0_RX_FIFO_SIZE_ID == 3)
#define RTE_I2C0_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2C0_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2C0_RX_FIFO_SIZE_ID == 4)
#define RTE_I2C0_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2C0_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2C0_RX_FIFO_SIZE_ID == 5)
#define RTE_I2C0_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2C0_RX_FIFO_SIZE_NUM     32
#elif  (RTE_I2C0_RX_FIFO_SIZE_ID == 6)
#define RTE_I2C0_RX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_I2C0_RX_FIFO_SIZE_NUM     64
#else
#error "Invalid I2C0_RX FIFO SIZE Configuration!"
#endif

//   <o> I2C0_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32 <6=>64 
#define RTE_I2C0_TX_FIFO_SIZE_ID                2
#if    (RTE_I2C0_TX_FIFO_SIZE_ID == 0)
#define RTE_I2C0_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2C0_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2C0_TX_FIFO_SIZE_ID == 1)
#define RTE_I2C0_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2C0_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2C0_TX_FIFO_SIZE_ID == 2)
#define RTE_I2C0_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2C0_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2C0_TX_FIFO_SIZE_ID == 3)
#define RTE_I2C0_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2C0_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2C0_TX_FIFO_SIZE_ID == 4)
#define RTE_I2C0_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2C0_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2C0_TX_FIFO_SIZE_ID == 5)
#define RTE_I2C0_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2C0_TX_FIFO_SIZE_NUM     32
#elif  (RTE_I2C0_TX_FIFO_SIZE_ID == 6)
#define RTE_I2C0_TX_FIFO_SIZE         FIFO_SIZE_64
#define RTE_I2C0_TX_FIFO_SIZE_NUM     64
#else
#error "Invalid I2C0_TX FIFO SIZE Configuration!"
#endif

//</e>

// <e> I2C1 (Inter-Integrated circuit) [Driver_I2C1]
// <i> Configuration settings for Driver_I2C1 in component ::Drivers:I2C
#define RTE_I2C1                      0

//   <o> I2C1_TX Pin <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <4=>P2_10 <5=>P2_11   
#define RTE_I2C1_TX_ID                0

#if    (RTE_I2C1_TX_ID == 0)
#define RTE_I2C1_TX_PORT              P0_6
#define RTE_I2C1_TX_AF                P0_6_AF_U0C1_DOUT0
#elif  (RTE_I2C1_TX_ID == 1)
#define RTE_I2C1_TX_PORT              P0_7
#define RTE_I2C1_TX_AF                P0_7_AF_U0C1_DOUT0
#elif  (RTE_I2C1_TX_ID == 2)
#define RTE_I2C1_TX_PORT              P1_2
#define RTE_I2C1_TX_AF                P1_2_AF_U0C1_DOUT0
#elif  (RTE_I2C1_TX_ID == 3)
#define RTE_I2C1_TX_PORT              P1_3
#define RTE_I2C1_TX_AF                P1_3_AF_U0C1_DOUT0
#elif  (RTE_I2C1_TX_ID == 4)
#define RTE_I2C1_TX_PORT              P2_10
#define RTE_I2C1_TX_AF                P2_10_AF_U0C1_DOUT0
#elif  (RTE_I2C1_TX_ID == 5)
#define RTE_I2C1_TX_PORT              P2_11
#define RTE_I2C1_TX_AF                P2_11_AF_U0C1_DOUT0
#else
#error "Invalid I2C1_TX Pin Configuration!"
#endif


//   <o> I2C1_RX Pin Pin <0=>P1_3 <1=>P1_2 <2=>P0_6 <3=>P0_7 
#define RTE_I2C1_RX_ID                0

#if    (RTE_I2C1_RX_ID == 0)
#define RTE_I2C1_RX_PORT              P1_3
#define RTE_I2C1_RX_INPUT             USIC0_C1_DX0_P1_3
#elif  (RTE_I2C1_RX_ID == 1)
#define RTE_I2C1_RX_PORT              P1_2
#define RTE_I2C1_RX_INPUT             USIC0_C1_DX0_P1_2
#elif  (RTE_I2C1_RX_ID == 2)
#define RTE_I2C1_RX_PORT              P0_6
#define RTE_I2C1_RX_INPUT             USIC0_C1_DX0_P0_6
#elif  (RTE_I2C1_RX_ID == 3)
#define RTE_I2C1_RX_PORT              P0_7
#define RTE_I2C1_RX_INPUT             USIC0_C1_DX0_P0_7
#else
#error "Invalid I2C1_RX Pin Configuration!"
#endif


//   <o> I2C1_CLK OUTPUT <0=>P0_8 <1=>P1_3 <2=>P1_4 <3=>P2_1 <4=>P2_11
#define RTE_I2C1_CLK_OUTPUT_ID                0

#if    (RTE_I2C1_CLK_OUTPUT_ID == 0)
#define RTE_I2C1_CLK_OUTPUT_PORT              P0_8
#define RTE_I2C1_CLK_AF                       P0_8_AF_U0C1_SCLKOUT
#elif  (RTE_I2C1_CLK_OUTPUT_ID == 1)
#define RTE_I2C1_CLK_OUTPUT_PORT              P1_3
#define RTE_I2C1_CLK_AF                       P1_3_AF_U0C1_SCLKOUT
#elif  (RTE_I2C1_CLK_OUTPUT_ID == 2)
#define RTE_I2C1_CLK_OUTPUT_PORT              P1_4
#define RTE_I2C1_CLK_AF                       P1_4_AF_U0C1_SCLKOUT
#elif  (RTE_I2C1_CLK_OUTPUT_ID == 3)
#define RTE_I2C1_CLK_OUTPUT_PORT              P2_1
#define RTE_I2C1_CLK_AF                       P2_1_AF_U0C1_SCLKOUT
#elif  (RTE_I2C1_CLK_OUTPUT_ID == 4)
#define RTE_I2C1_CLK_OUTPUT_PORT              P2_11
#define RTE_I2C1_CLK_AF                       P2_11_AF_U0C1_SCLKOUT
#else
#error "Invalid I2C1 CLOCK OUTPUT Pin Configuration!"
#endif


//   <o> I2C1_CLK INPUT Pin <0=>P1_3 <1=>P0_8 <2=>P0_7 
  
#define RTE_I2C1_CLK_INPUT_ID                1

